OpenFOAM-v1712/tutorials/combustion/fireFoam/LES/oppositeBurningPanels/0/C3H8
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    object          C3H8;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    ground
    {
        type            zeroGradient;
        value           $internalField;
    }
    sides
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    burner
    {
        type            totalFlowRateAdvectiveDiffusive;
        value           uniform 1.0;
    }
    "(region0_to.*)"
    {
        type            totalFlowRateAdvectiveDiffusive;
        value           $internalField;
    }
}


// ************************************************************************* //
