OpenFOAM-v1712/tutorials/combustion/fireFoam/LES/oppositeBurningPanels/system/panelRegion/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 6;

method          structured;

structuredCoeffs
{
    method      hierarchical;
    patches     (region0_to_panelRegion_fRight_zone region0_to_panelRegion_fLeft_zone);

    hierarchicalCoeffs
    {
         n               (2 3 1);
         delta           0.001;
         order           xyz;
    }
}

coeffs
{
    n           (1 2 3);
    //delta       0.001; // default=0.001
    //order       xyz;   // default=xzy
    dataFile    "cellDecomposition";
}

// ************************************************************************* //
